{
  "reviews": [
    {
      "rating": 4,
      "date": 30,
      "review_text": "I thought that the plaza was bland and dead. Then this place came along and brought salvation on to Waterloo. No I'm joking, but this place does taste really fantastic. Having been to Lanzhou myself I think that the flavor here is pretty authentic and the side dishes are well put together and taste great. The service is polite and very fast. There is usually a wait but it's never long cause of the speedy service. All in all one of the best places to eat in this plaza so far and fantastic on a cold winter day."
    },
    {
      "rating": 4,
      "date": 14,
      "review_text": "Handpulled noodles are pretty good. Broth is tasty, chili is not that hot, but flavourful. You can order tendon during the weekend. Portions are an insane size, even if you get the smallest one. Great value for students, and this is evident from the amount of traffic this place gets. Expect to wait 15-30 minutes during peak times."
    },
    {
      "rating": 5,
      "date": 30,
      "review_text": "Best Chinese Ramen (Pulled-Noodle) in town...and best in Ontario too! This place is always busy. Be prepared. Their soup broth is just outstanding! Staff are excellent too! 10 star!"
    },
    {
      "rating": 4,
      "date": 30,
      "review_text": "Amazing noodles: I prefer the thinnest size as it picks up the broth so well. A bit slow on service, but they're gradually improving. Great place to go for a warm meal."
    },
    {
      "rating": 3,
      "date": 150,
      "review_text": "New genre of Chinese noodle place at the plaza. If you’re hungry, go for their large size noodle soup. (It’s filling...) They offer various sizes/diameter of the noodle. I recommend the thin ones, because they get cooked much more thoroughly compared to thicker noodle) They get really busy at normal lunch (12pm) and dinner hours (6-7pm). It’s a nice spot to go during the cold winter."
    },
    {
      "rating": 1,
      "date": 30,
      "review_text": "Terrible service and the staff are insolent and rude. A waiter seated me and my friend at a four-seat table, but soon the other waitress with glasses who was also seating customers came straight to us and asked us to stand up and go back to the waiting line, because a group of three just came in and she was giving our table to them! Asked for the reason and she simply replied that this is their policy! What kind of policy could it be to force the customers already seated and ready to order to go back waiting and give their table to other customers who come in much later only because they have more people in numbers? She kept saying sorry but it’s so bullying in tone, and forced us to leave the table by taking away our water and menus and standing behind us. See previous reviews from some other people sharing similar experience. Obviously they never improve their service. Won’t go there anymore."
    },
    {
      "rating": 3,
      "date": 90,
      "review_text": "t was very difficult to call servers over, and we had to ask multiple times for them to bring something. Value of the large bowl is amazing - its a REALLY large bowl, but the broth itself tasted pretty basic. The chili oil had no flavour or spice, just tasted like oil. We ordered a meat side dish and it was literally 5 pieces of the meat they serve with the classic noodle bowl except doused in the bland chili oil and charged at $6."
    },
    {
      "rating": 1,
      "date": 90,
      "review_text": "When I went the service was horrible. They seated us and completely forgot about us. We tried to wave down a server several times but they always said they’re will be right back. At one point another couple came in after we were waiting to order for 20 mins and they got their food before us. I’ve never seen such respectful service before. there are other Chinese noodles places around the plaza which respect the customer more. I don’t recommend this one."
    },
    {
      "rating": 4,
      "date": 180,
      "review_text": "Great authentic warm flavour from the OG beef noodle soup. A bit slower service as they are new so you have to keep getting the waiter's attention but they are very apologetic about it as they try to sort out their system. The regular bowl is more than enough for me with a generous helping of noodle but they also have a larger version of you're hungry. Also pro tip, if you get it spicy they just add the chili oil from the table so you can just get it regular if you want to adjust your spicy level."
    },
    {
      "rating": 1,
      "date": 30,
      "review_text": "You get a discount for 5 star reviews. Don't trust the rating, awful."
    }
  ]
}